12/data/attachments/7715c3a9821f1942.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b8bdc268-8d1c-4fe1-af39-b8ece679cdb1</nif:username>
            <nif:friendToBeAdded>Jennifer_great_Actions_43477_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>